{"_id":{"$oid":"59188f74fcdcbe1334292bef"},"id":"1","title":"Начинается разработка OpenJDK 10","summary":"Сегодня Mark Reinhold объявил об открытии репозиториев mercurial для Java 10.","createdAt":{"$date":"2017-01-26T03:38:00.000Z"},"author":"lany","tags":["java","JDK 10","программирование"],"content":"Сегодня Mark Reinhold объявил об открытии репозиториев mercurial для Java 10, и разработчики, имевшие статус committer и выше в проекте Java 9, получили возможность размещать багфиксы и мелкие улучшения, которые не предполагается вносить в Java 9. Всем разработчикам (например, мне) обновили статус на страничке переписи OpenJDK.\nКрупные изменения вносить пока не рекомендуется во избежание конфликтов. Изменения в Java 9 ещё не завершены и некоторое время придётся их переносить в Java 10. При отсутствии конфликтов процедура будет автоматизирована, так что тем, кто продолжает вносить исправления в Java 9, скорее всего не придётся лишний раз беспокоиться.\nРазумеется, разработка возможностей, которые не планируется включать в Java 9, велась и раньше. Серьёзные проекты вроде Valhalla и Panama разрабатываются пока в отдельных форках без привязки к версии Java. Когда они будут готовы, произойдёт большая работа по слиянию веток, как это было с Jigsaw. Отдельные эксперименты вроде прототипирования вывода типов локальных переменных ведутся вне официальных деревьев. Но именно сейчас отличное время, чтобы предложить в десятку (и реализовать!) какую-нибудь важную фичу, которой вам очень не хватает в Java. Как известно, при приближении к релизу новые предложения будут наталкиваться на всё большее сопротивление.\nПока тематических списков рассылки по Java 10 не создано, имеется только общий список jdk10-dev, поэтому за всеми новостями можно следить, подписавшись на него.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bf0"},"id":"2","title":"Краткое жизнеописание семейства Intel Atom","summary":"В этом посте мы вспомним историю Intel Atom, поговорим о последних событиях, с ними связанными, а в заключении познакомимся с новыми моделями из этого семейства, похожими скорее на Intel Xeon.","createdAt":{"$date":"2017-03-02T07:14:00.000Z"},"author":"saul","tags":["процессоры","intel","intel atom"],"content":"За последний год во вселенной процессоров Intel Atom произошел ряд буквально галактических катаклизмов, как разрушительного, так и созидательного порядка. В их результате она была, можно сказать, полностью перестроена. В этом посте мы вспомним историю Intel Atom, поговорим о последних событиях, с ними связанными, а в заключении познакомимся с новыми моделями из этого семейства, похожими скорее на Intel Xeon.\nIntel Atom были задуманы компанией Intel как бюджетное решение с минимальным энергопотреблением для различного рода мобильных устройств. Первый Atom появился в 2008 году, он был выполнен по технологии 45 нм, со временем техпроцесс сократился до 14 нм. Успех процессоров Atom сильно отличался в зависимости от области их применения. Так, некоторая их часть определенно появилась в нужное время и получила широкое распространение в новомодных тогда «нетбуках» («ноутбуках для работы в сети»). Работали такие нетбуки по сравнению с ноутбуками на процессорах Core небыстро, зато были дешевы, компактны, не имели кулера (и сопутствующих ему проблем), и хорошо продавались. Вспомним хотя бы суперпопулярный ASUS Eee PC 901, и отметим, что нетбуки выпускали такие солидные производители как HP, Lenovo, Dell и Sony.\nГораздо менее успешно сложилась судьба Intel Atom как x86-конкурента ARM-процессоров для смартфонов и планшетов. Хотя и тут есть очень заметный результат — выход в 2015 году Microsoft Surface 3 с процессором Intel Atom x7-Z8700.\nНадо отметить, что сделано Intel в этом ключевом направлении было очень много — мобильные Атомы последнего поколения, появившегося в 2013-2014 году, по производительности далеко ушли от своих первых прародителей, а по возможностям приблизились к Intel Core: в них было полностью обновлено графическое ядро — Intel HD Graphics, микроархитектура изменена на неупорядоченное (out of order) исполнение, добавлены векторные инструкции SSE4. Тем не менее, интерес к Атомам со стороны производителей был умеренным: несмотря на приличные показатели энергоэффективности (что констатировали весьма уважаемые ресурсы), эксплуатационные преимущества не были столь весомыми, чтобы затевать масштабную движуху по смене платформы. Не последнюю роль тут сыграл и финансовый вопрос: Intel Atom были все-таки дороже своих ARM-соперников.\nК 2013 году было анонсировано около десятка моделей смартфонов на Atom, часть из которых так и не вышла в серию. В нашей стране продавался брендированный Мегафоном смартфон Orange San Diego под маркой Mint.\nIntel активно продвигала платформу Android x86 среди разработчиков: создавала средства разработки, публиковала обучающие материалы, проводила мероприятия. Более того, был создан уникальный бинарный транслятор, работавший на всех мобильных устройствах c Android на базе Atom, и на лету переводивший ARM код в x86 инструкции почти без потери производительности.\nОднако, как уже было сказано выше, устройств на основе Atom было выпущено немного (по сравнению с количеством ARM-устройств на рынке), что приводило к порочному кругу — независимые разработчики не спешили выпускать новые эксклюзивные x86 приложения для данных малочисленных устройств, а производители устройств, в свою очередь, не спешили выпускать новые модели из за отсутствия уникальных приложений. Кроме того, не сработало теоретическое конкуретное преимущество Atom — возможность запуска десктопных приложений на мобильных устройствах одной архитектуры. Во-первых, портировать приложения все равно приходилось просто из за несовпадения настольных и мобильных ОС (Windows или MacOS -\u003e Android) и форм-факторов, причем, обычно это оказывалось даже труднее, чем возможный переход от x86 к ARM; а во-вторых, за время безраздельного господства ARM на мобильном рынке, все компании, желавшие создать мобильные версии своих настольных продуктов, уже сделали это для ARM-устройств, так что появление x86 только добавило им хлопот — необходимость создавать и поддерживать версии приложения для разных CPU.\nКак бы то ни было, при глобальной реорганизации 2016 года направление Atom для мобильных устройств было срублено под корень.\nОднако труд создателей процессоров даром не пропал. В Intel появилось новое направление, которое постепенно стало одним из ключевых: «интернет вещей». Именно совокупность компонентов «интернета вещей» является оптимальным потребителем процессоров семейства Atom с их низким энергопотреблением и широким диапазоном характеристик. Так мы незаметно приблизились к нашему времени.\nК настоящему моменту Intel выпустил огромное количество моделей Intel Atom, однако актуальных из них не так и много. Это прежде всего свежеанонсированная серия Е3900 (ее сравнительную таблицу вы видите выше). Серия призвана закрыть потребность в высокопроизводительных хабах «интернета вещей» (запросы поскромнее призваны удовлетворять платформы Intel Galileo, Edison и Curie).\nОднако это еще не предел «прокачки» Атома. Тут мы подходим к новому анонсу. На смену «серверной» линейки Atom C2000 образца далекого 2013 года приходит серия С3000, которая призвана поднять производительность Intel Atom на новую высоту. Флагманом серии станет 16-ядерная модель — столько ядер в Atom еще не было никогда. При этом все «фирменные» особенности — энергоэффективность и доступная для серверных моделей цена — остаются неизменными. Пока что доступна информация об одном из младших моделей серии — процессоре C3338. Анонсы остальных ждем во втором полугодии 2017 года.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bf1"},"id":"3","title":"Разработка JDK 9 прошла фазу «Feature Complete»","summary":"Марк Рейнхольд (Mark Reinhold) на днях сообщил что разработка JDK 9 прошла фазу «Feature Complete». ","createdAt":{"$date":"2017-01-23T05:33:00.000Z"},"author":"igor_suhorukov","tags":["java","программирование","JDK 9"],"content":"Марк Рейнхольд (Mark Reinhold) главный архитектор платформы Java в Oracle на днях сообщил в рассылке что разработка JDK 9 прошла фазу «Feature Complete».\nЧто значит, что добавление новой функциональности в проект приостановлено и теперь необходимо сконцентрировать усилия сообщества разработчиков на исправлении ошибок.\nЕсли разбить список новой функциональности по группам, то JDK 9 будет включать в себя:\nМодуляризация\n200: The Modular JDK (Jigsaw/JSR 376 и JEP 261)\n201: Modular Source Code\n220: Modular Run-Time Images\n238: Multi-Release JAR Files\n259: Stack-Walking API\n261: Module System\n275: Modular Java Application Packaging\n282: jlink: The Java Linker\nУпрощение разработки на языке java\n193: Variable Handles\n213: Milling Project Coin\n222: jshell: The Java Shell (Read-Eval-Print Loop)\n266: More Concurrency Updates\n269: Convenience Factory Methods for Collections\n277: Enhanced Deprecation\n285: Spin-Wait Hints\nСтроки\n250: Store Interned Strings in CDS Archives\n254: Compact Strings\n280: Indify String Concatenation\nДиагностика\n228: Add More Diagnostic Commands\n240: Remove the JVM TI hprof Agent\n241: Remove the jhat Tool\nПараметры запуска JVM\n214: Remove GC Combinations Deprecated in JDK 8\n245: Validate JVM Command-Line Flag Arguments\n248: Make G1 the Default Garbage Collector\nЛогирование\n158: Unified JVM Logging\n264: Platform Logging API and Service\n271: Unified GC Logging\nJavadoc\n224: HTML5 Javadoc\n225: Javadoc Search\nJavaScript/HTTP\n110: HTTP 2 Client\n236: Parser API for Nashorn\n289: Deprecate the Applet API\n292: Implement Selected ECMAScript 6 Features in Nashorn\nNative Platform\n102: Process API Updates\n272: Platform-Specific Desktop Features\nJavaFX\n253: Prepare JavaFX UI Controls \u0026 CSS APIs for Modularization\n257: Update JavaFX/Media to Newer Version of GStreamer\nРабота с изображениями\n251: Multi-Resolution Images\n262: TIFF Image I/O\nUnicode\n227: Unicode 7.0\n267: Unicode 8.0\nРазные плюшки\n219: Datagram Transport Layer Security (DTLS)\n256: BeanInfo Annotations\n260: Encapsulate Most Internal APIs\n274: Enhanced Method Handles\n295: Ahead-of-Time Compilation\nВыпуск JDK 9 запланирован на 27 июля 2017(фаза General Availability), если верить текущей информации с портала openjdk.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bf2"},"id":"4","title":"НАСА не слишком довольно планами Маска полететь на Луну в 2018 году","summary":"На днях SpaceX заявила о намерении отправить двух туристов в полет вокруг Луны уже в конце следующего года.","createdAt":{"$date":"2017-03-01T14:12:00.000Z"},"author":"marks","tags":["космонавтика","луна","полёт на луну","НАСА","spacex"],"content":"На днях SpaceX заявила о намерении отправить двух туристов в полет вокруг Луны уже в конце следующего года. Насколько можно понять, в компании Илона Маска уже знают, кого будут отправлять, поскольку заявлено о том, что тренировки людей начнутся уже в этом году. Более того, туристы и финансируют всю (или почти всю) лунную программу (об этом ниже). Детальная информация о том, кто полетит будет опубликована уже после того, как все потенциальные участники проекта пройдут ряд тестов медицинского характера.\nБез тяжелой ракеты-носителя такой полет будет невозможен, так что компания планирует использовать разрабатываемую ею сейчас ракету-носитель Falcon Heavy. Фактически, это три объединенных в единое целое ракеты Falcon. Что касается космического корабля, то им станет Dragon 2. Разработка ракеты-носителя финансируется SpaceX, а Dragon 2, в основном — агентством НАСА. Причем похоже на то, что руководство агентства не слишком радуется новостям о лунном проекте Маска.\nПочему так? Ведь НАСА — давний партнер SpaceX, предоставляющий молодой компании крупные суммы. В 2008 году НАСА заключило с космической компанией Илона Маска контракт на $1,8 млрд, с целью получения нового «космического извозчика», способного доставлять людей и грузы на МКС и обратно. Также НАСА договорилось с Маском о предоставлении его компании еще нескольких миллиардов для реализации связанных с основным проектов, главный из которых — космический корабль Dragon 2. Почти сразу же после появления новости о намерении полететь к Луне НАСА сделало, на первый взгляд, поддерживающее SpaceX заявление, где говорилось следующее: «НАСА одобряет желание своих партнеров достигать большего».\nНо это только на первый взгляд. О том, что НАСА не слишком довольно скоростью работы SpaceX в отношении заключенного с агентством контракта, можно понять из следующей фразы опубликованного заявления: «Мы будем работать с SpaceX для того, чтобы убедиться в выполнении контрактных обязательств по возвращению площадки запуска астронавтов в США и продолжении успешной доставки грузов на МКС». Это может означать только одно — агентство просит своего партнера, которому выплачиваются громадные средства из бюджета, сосредоточиться на выполнении очень недешевого контракта. SpaceX же хочет бросить значительную часть своих ресурсов на реализацию новых планов.\nНесколько неудачных моментов работы НАСА с компанией Маска\nВ целом, сотрудничество НАСА и SpaceX можно назвать продуктивным. Но проблем тоже немало:\nВ июне 2015 года ракета Falcon 9 взорвалась через две минуты полета. НАСА потеряло 2,5 тонны полезных грузов, включая достаточно дорогой элемент шлюза. Агентство поддержало SpaceX, полеты продолжились. Но это было чувствительным ударом;\nДля экономии средств и времени, SpaceX предложило заправлять ракету охлажденными элементами топливной системы сразу перед стартом, уже с командой на борту. Но в сентябре прошлого года эта система дала сбой и Falcon 9 взорвалась прямо на стартовой площадке. Взрыв уничтожил ракету и спутник, который она должна была вывести на орбиту. У корабля Dragon есть система эвакуации команды, так что астронавты, скорее всего, выжили бы. Но у НАСА появилось много сомнений относительно предлагаемой партнером схемы заправки ракеты;\nТакже в прошлом году SpaceX громко заявила о планах по колонизации Марса к 2020 году. Компания рассказала о том, что стоимость отправки первых колонистов на Марс — всего $10 млрд. Но вот проблема — для того, чтобы проект был реализован, SpaceX нужна и Межпланетная транспортная система. Ее разработка — дорогое удовольствие, требующее вливания очень крупных сумм денег. Кого SpaceX видит в качестве источника финансов? НАСА. И это при том, что у агентства есть собственный (тоже очень недешевый) план полета на Марс, только не к 2020, а к 2030 году;\nСовсем недавно НАСА заявило о намерении провести оценку реализации проекта по отправке двух астронавтов в путешествие вокруг Луны в 2019 году. Выполнить такой полет планировалось с использованием ракеты-носителя Space Launch System и космического корабля Orion. И почти сразу SpaceX анонсирует собственные планы по реализации такого же проекта, только на год раньше, чем у НАСА;\nПланов у SpaceX много, но есть еще и обязательства перед НАСА. А они выполняются не слишком хорошо. Ранее компания Маска обещала начать отправку астронавтов на МКС в конце 2017 года. Сейчас срок сместился, и в планах отправки людей на орбиту стоит уже вторая половина 2018 года. Из-за срыва сроков НАСА пришлось выкупить пять мест для американской команды на «Союзе», чего ранее агентство делать не собиралось. Общая сумма контракта составила $373,5 млн.\nИсточники, близкие к НАСА, считают, что заявление SpaceX появилось очень некстати, поскольку компании еще предстоит наладить процесс отправки американских астронавтов на МКС. Эта позиция отражает мнение руководства агентства.\nНовости от SpaceX\nКомпания еще в понедельник рассказала о том, что планы по облету Луны появились после того, как с руководством связалось двое потенциальных космических путешественника. Они предложили профинансировать проект, оставив депозиты (возвратные или нет — не сообщается), став первыми людьми, полетевшими к Луне, за 40 лет. Продолжительность такого путешествия, по расчетам, составит около недели.\n«Это действительно случилось. Мы будем реализовать пилотируемую миссию к Луне… (и пассажиры) серьезно настроены на это. Мы планируем реализовать миссию с использованием космического корабля Dragon 2 и ракеты Falcon Heavy», — сообщил Маск журналистам. В целом, экспедиция будет похожа на миссию «Аполлон 13».\nСумма, которую выделят путешественники, останется неизвестной. Но Маск оговорился, что цена путешествия будет немного выше отправки людей на МКС при помощи Falcon Heavy. А это около $300 млн. Компания надеется, что это будет лишь первым полетом в серии аналогичных путешествий для космических туристов. В SpaceX считают, что полеты к Луне могут приносить компании десятую часть годовой выручки.\nКак уже говорилось выше, личность этих людей тоже неизвестна. Илон Маск лишь заявил, что они не связаны с Голливудом и хорошо знают друг друга. За время путешествия корабль с туристами пройдет около 500-600 тысяч километров. Продолжительность полета составляет около недели. Высадка на спутник не планируется.\nЭнтузиазм Маска заразителен, и, в целом, сам проект облета Луны выглядит многообещающе. Проблема в том, что пока что у компании нет технической возможности полететь к Луне. Тяжелая ракета-носитель Falcon Heavy пока не готова, хотя ее испытания и запланированы на этот год. Как дело обстоит в реальности — пока неясно. Правда, в январе SpaceX заявила о том, что все стартовые ступени свой ракеты компания планирует вернуть на Землю неповрежденными. Благодаря этому снижается стоимость запуска (расчетная величина — около $90 млн для Falcon Heavy).\n«Наши действия должны соответствовать ожиданиям США относительно того, что доставка грузов в космос может быть снижена, что позволит сделать более доступным изучение космического пространства», — сообщил ранее Маск. Для одновременной посадки ступеней компания готовит еще две дополнительных площадки. Если удастся договориться об их использовании с регуляторами США — ступени будут возвращать на сушу, если нет — одна из ступеней вернется на стартовую площадку, две другие сядут на морские платформы SpaceX в Атлантическом океане.\nDragon 2, космический корабль, который разрабатывается на деньги НАСА, тоже пока не готов. Пилотируемый полет этого корабля на МКС состоится не ранее мая 2018-го года. Кроме того, в контракте с НАСА предусмотрено еще два таких полета. Маск обещает отправить туристов только после выполнения договоренностей с НАСА.\nПо мнению сторонних специалистов, компания Маска может ошибаться в сроках выполнения лунного проекта. «Сроки — не самая сильная сторона SpaceX. Это (проект — прим. ред.) выглядит рискованно. Я считаю заявление SpaceX необычным, в свете того, что компания еще должна выполнить обязательства по доставке астронавтов на орбиту Земли», — заявила Мэри Линн Диттмар, исполнительный директор Coalition for Deep Space Exploration, организации, в которую входят представители аэрокосмических компаний.\nВ целом, все хорошо\nНесмотря на то, что ряд экспертов (включая сотрудников НАСА) выражают осторожное опасение относительно планов SpaceX, нерешаемых проблем здесь нет. В своем обращении, о котором уже говорилось выше, НАСА утверждает, что партнеры агентства свободны в том, чтобы разрабатывать собственные проекты, включая ракеты следующего поколения, космические корабли и программы по освоению глубокого космоса.\nУ НАСА вызывает опасения не сама программа, а то, что SpaceX не слишком хороша в выполнении своих обязательств в срок. Кроме того, НАСА может не нравится еще и то, что SpaceX демонстрирует готовность выполнять проекты, аналогичные тем, что реализует агентство, за гораздо меньшие суммы. Это уже прямая конкуренция, но здесь никто ничего сделать не в силах. Да и не нужно ничего предпринимать, ведь соперничество в космической сфере часто приводит к более быстрой реализации каких-либо программ.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bf3"},"id":"5","title":"Смените ваши пароли. Прямо сейчас ","summary":"Массивная утечка памяти веб-сервисов и систем безопасности компании Cloudflare может раскрыть пользовательские данные тысяч сайтов.","createdAt":{"$date":"2017-02-26T13:09:00.000Z"},"author":"larichev","tags":["утечка","безопасность"],"content":"Массивная утечка памяти веб-сервисов и систем безопасности компании Cloudflare может раскрыть пользовательские данные тысяч сайтов. Другими словами: пришло время сменить свои пароли.\nЕще много предстоит узнать о масштабах возможного вреда этой утечки, которую уже прозвали Cloudbleed – по аналогии с Heartbleed имевшей место еще в 2014 г. Однако даже то, что уже известно очень настораживает – часть утечки, которая возможно содержала пользовательские данные, могла попасть в кэш поисковиков. Потенциально это дает возможность большего распространения приватных данных, чем непосредственно сама утечка.\nCloudbleed был обнаружен 18 февраля Тэвисом Орманди, аналитиком группы безопасности Google Project Zero. Как именно была обнаружена и исправлена утечка памяти подробно подробно описано в этом посте (англ.). По словам Cloudflare, «самый большой объем утечек был с 13 по 18 февраля с примерно 1 из каждых 3 300 000 HTTP запросов через Cloudflare (это около 0.00003% от всех запросов, или примерно 100-200 тысяч страниц с приватными данными ежедневно).»\nХотя до сих пор нет официального списка пострадавших сайтов, но многие сервисы просят пользователей сменить свои пароли независимо от Cloudbleed. Пользователь Github опубликовал список сайтов (англ.) скомпрометированных, по его мнению и с оговоркой, что «только потому, что домен находится в списке не означает, что сайт взломан, а также сайты могут быть скомпрометированы, но отсутствовать в этом списке». Основываясь на собранных данных он утверждает, что более 4 миллионов сайтов находятся в зоне риска. Согласно же самой Cloudflare – скомпрометировано более чем 1000 доменов.\nСамое тревожное в этом то, что даже 2-факторная аутентификация не предохраняет от такого типа утечек и, предположительно, также требует смены пароля.\nТем временем Cloudflare пытается подсластить пилюлю публикуя заметки по типу «Мы также не обнаружили каких-либо доказательств вредоносного ПО использующего эту утечку», хотя это всего лишь то, что скажет любая большая компания, которая была бы замешана в такой гигантской течи.\nНиже приведены некоторые из наиболее известных сайтов, которые предположительно находятся под угрозой.\nВы можете читать список, но лучше сперва сменить пароли.\nauthy.com\ncoinbase.com\nbitcoin.de\nbetterment.com\ntransferwise.com\nprosper.com\npatreon.com\nbitpay.com\nnews.ycombinator.com\nproducthunt.com\nmedium.com\n4chan.org\nyelp.com\nokcupid.com\nuber.com\npoloniex.com\nlocalbitcoins.com\nkraken.com\n23andme.com\ncurse.com (и еще несколько сайте Curse, например minecraftforum.net)\ncounsyl.com\ntfl.gov.uk\naccount.leagueoflegends.com\nmyaccount.nytimes.com\ntechnicpack.net\ncloudflare.com\nblockchain.info\ndiscordapp.com (подтверждена утечка)\ndigitalocean.com (утечки данных не обнаружено в кэше поисковиков)\nnamecheap.com (утечки данных не обнаружено в кэше поисковиков)\nglassdoor.com (утечки данных не обнаружено в кэше поисковиков)\nvultr.com (утечки данных не обнаружено в кэше поисковиков)\ntineye.com\nfeedly.com\nthepiratebay.org\npastebin.com\nupwork.com","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bf4"},"id":"6","title":"EFF: мы на полпути к безопасному интернету","summary":"Мировое движение за зашифровку всего интернета объявило о достижении важной вехи.","createdAt":{"$date":"2017-02-26T13:27:00.000Z"},"author":"alizar","tags":["шифрование","безопасность","https","eff"],"content":"Правительства разных стран прикладывают усилия по контролю граждан и мониторингу всего интернета. Единственный способ сохранить свободу — надёжное шифрование всех соединений. Мировое движение за зашифровку всего интернета объявило о достижении важной вехи. Примерно в начале февраля 2017 года доля интернет-трафика, защищённого HTTPS, впервые превысила 50%. Россия лидирует в мире по темпам роста трафика HTTPS.\nТаким образом, как говорит Фонд электронных рубежей, мы на полпути к безопасному интернету, защищённому от прослушки, подмены контента, кражи куков и цензуры. Против всех этих вредоносных явлений защищает HTTPS.\nВ конце января 2017 года о преодолении рубежа в 50% зашифрованного трафика сообщила Mozilla. Чуть позже это подтвердила телеметрия Firefox, которая рассчитывается как скользящее среднее за последние 14 дней. По данным телеметрии, скользящее среднее за две недели преодолело отметку 50% 6 февраля 2017 года. Если 5 февраля значение составляло 49,98875%, то 6 февраля — 50,37423%.\nВ феврале 2017 года доля зашифрованного трафика в интернете впервые превысила 50%, данные телеметрии Firefox\nЗа последний день, когда доступна статистика Firefox, 24 февраля 2016 года, скользящее среднее составляет 50,88921%.\nМожно было бы предположить, что пользователи Firefox чуть более продвинутые, чем обычные пользователи, они чаще заходят на хорошие сайты с поддержкой HTTPS, но статистика самого популярного в мире браузера Chrome подтверждает эти выводы: сейчас более половины веб-трафика защищено HTTPS под всеми операционными системами, кроме Android.\nПоследняя статистика за 18 февраля 2017 года:\nChrome OS: 71%\nMac OS: 66%\nLinux: 57%\nWindows: 56%\nAndroid: 49%\nЧто характерно, доля защищённого трафика в некоторых странах растёт быстрее, чем в других. Например, в России растёт гораздо быстрее, чем в Японии. За последние два года эта доля HTTPS под Windows в Японии выросла с 23% до 37%, в России — с 28% до 55%, в США — с 44% до 65%.\nЗа последние годы под давлением общественности много крупных сайтов перешли на использование HTTPS по умолчанию. Это сделали Facebook, Twitter и Википедия. Затем и компания Google надавила на всех остальных, начав учитывать HTTPS в качестве фактора ранжирования в результатах поиска в августе 2014 года. В браузере Chrome для сайтов, не защищённых HTTPS, появилось специальное сообщение безопасности с января 2017 года. Возможно, этим, в том числе, объясняется некоторый всплеск популярности HTTPS в январе-феврале 2017 года, заметный на графиках. Пользователи начинают понимать, что отсутствие криптографической защиты трафика — угроза для их безопасности со стороны правительства и других агентов, которые стремятся к прослушке и перехвату трафика. Чтобы не терять аудиторию, веб-сайты вынуждены устанавливать бесплатные сертификаты и немножко увеличивать нагрузку на свои серверы, шифруя трафик.\nК движению за безопасный веб присоединились некоторые общественные организации и СМИ. Например, Фонд свободных рубежей периодически публикует отчёт Encrypt the Web о состоянии дел с шифрованием в Сети. Появились такие же отчёты о шифровании на сайтах средств массовой информации Secure the News и шифровании на правительственных сайтах Pulse. Например, 74% американских государственных сайтов уже перешли на HTTPS.\nВажную роль в практической реализации HTTPS сыграли бесплатный центр сертификации Let’s Encrypt, а также инструмент Certbot, позволяющий получить бесплатный сертификат Let’s Encrypt и автоматически сконфигурировать его для своего сервера. Популярность Let’s Encrypt стремительно растёт до настоящего времени. В октябре 2016 года о стал крупнейшим центром сертификации в мире с 12 млн сертификатов, а сейчас количество сертификатов превысило 28 млн.\nЗначительная часть этого роста достигнута благодаря переходу на Let’s Encrypt многих крупных хостингов и платформ для размещения сайтов, таких как WordPress.com, Squarespace, Digital Ocean, Dreamhost.com, OVH.com, SiteGround.com и десятков других.\nНапомним, что по пакету законов Яровой-Озерова российское государство хочет записывать и хранить весь трафик пользователей в течение длительного времени. Что ж, теперь больше половины этого трафика будет в зашифрованном виде.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bf5"},"id":"7","title":"Когда люди начали менять планету","summary":"Никто не знает, в какой именно день недели астероид девяти километров диаметром врезался в то место, которое затем станет полуостровом Юкатан. Известно, что день этот настал примерно 65 млн лет назад, и что последовавшие дни были холоднее, темнее, и видели всё меньше и меньше динозавров.","createdAt":{"$date":"2017-02-25T13:53:00.000Z"},"author":"SLY_G","tags":["экология","Земля","антропоцен"],"content":"Никто не знает, в какой именно день недели астероид девяти километров диаметром врезался в то место, которое затем станет полуостровом Юкатан. Известно, что день этот настал примерно 65 млн лет назад, и что последовавшие дни были холоднее, темнее, и видели всё меньше и меньше динозавров.\nСтолкновение изменило все системы поддержки жизни на Земле, выбросив в воздух огромное количество пыли, испарив гигантские объёмы воды и запустив сотни землетрясений и извержений вулканов. Удар, и последовавшее за ним массовое вымирание, отмечает одну из самых известных геологических границ, между закатом мелового периода и рассветом палеогенового периода. Люди – это внеплановая версия такого астероида, в смысле глобального влияния на планету; они изменили её так сильно, что многие учёные считают, что это заслуживает своей собственной геологической эпохи – антропоцена. И хотя никто не знает, в какой из дней люди стали силой природы, парочка учёных считают, что могут вывести уравнение, чтобы подсчитать год, когда это произошло.\nЭтой планете 4,5 млрд лет. Почти три четверти этого времени на ней существовала жизнь. «Земля обычно находится в состоянии равновесия, и силы обратной связи поддерживают баланс атмосферы и температуры на длительных промежутках времени», — говорит Оуэн Гафни, писатель и соавтор нового исследования, опубликованного в журнале Anthropocene Review. Во времена равновесия жизненные формы эволюционируют медленнее, вымирания случаются редко, а биоразнообразие увеличивается. А потом случается столкновение с астероидом или извержение мегавулкана. Или Земля наклоняет ось вращения на полградуса. Каждый такой катаклизм меняет атмосферу, температуру, состав океанов и десятки других процессов, определяющих, кто способен выжить.\n• К 1700 году используемая людьми суша составляла лишь 5% от Земли, к 2000 году – уже 55%.\n• Выбросы парниковых газов, происходящие по вине людей, повышают кислотность океанов почти с такой же скоростью, как перед массовым пермским вымиранием (оно же величайшее вымирание), начавшемся 300 млн лет назад [по данным 2012 года — 252,2 ± 0,5 млн лет].\n• По самым скромным оценкам, текущая скорость вымирания в 10 раз превышает самую большую скорость в периоды экологического равновесия.\n«Таких примеров можно набросать настолько длинный список, что станет скучно обсуждать все способы, которыми человечество изменяет планету», – говорит Эрл Эллис [Erle Ellis], ландшафтный эколог из Мэрилендского университета. Спорный момент состоит, по его словам, в попытке авторов работы выяснить точную дату, после которой люди начали доминировать на планете.\nЭллис – член рабочей группы, задачей которой выбрана предварительная работа по определению антропоцена как формальной геологической эпохи. Формализация этого понятия будет знаковым событием, и вызывает жаркие споры среди учёных. Но вопрос не в том, приводит ли деятельность человека к изменению жизни на Земле. «Об этом никто не спорит», – говорит Эллис. Реальная проблема рабочей группы лежит в практической плоскости: повлечёт ли деятельность людей появление достойного для изучения будущими геологами стратиграфического слоя? Какой смысл давать имя несуществующему пока слою камней? «Введение новой эпохи не даёт никакой пользы специалистам по стратиграфии и археологии, работающим с камнями и разбирающимся в процессах их формирования», – говорит Эллис. Однако Эллис принадлежит к меньшинству учёных из рабочей группы по антропоцену, верящих, что эта эпоха укоренилась в истории человечества гораздо глубже. «Индустриальная революция произошла гораздо раньше 1950-х, – говорит он. – Также можно рассмотреть удивительный эффект сельского хозяйства, возрастом несколько тысяч лет, оказанный им на биосферу».\nСоавтор Гафни, климатолог Уилл Стеффен из Австралийского национального университета, тоже участвует в этой рабочей группе. В новой работе эта пара учёных описывает уравнение, сравнивающее эффекты последних нескольких сотен лет с базовым уровнем голоцена, длящегося последние 11700 лет. «Мы выбрали ключевые процессы Земли и скорость их изменения», – говорит Гафни. Большую часть времени системы находились в равновесии – стабильно удерживались флегматичной солнечной активностью, наклоном земной оси в 26,5° [по данным НАСА, 23,44°], и отсутствием падающих с неба камней размером с остров.\nСогласно их подсчётам, человеческая деятельность по своим результатам затмила солнце, Землю и иногда падающие звёзды и стала основным процессом, формирующим жизнь, где-то около 1950 года. «Это совпадает с первыми атомными бомбами, добавившими в атмосферу отслеживаемую радиацию, отслеживаемую в осадочных породах», – говорит Гафни. И они не первые, кто обратил внимание на период сразу после войны. 1950-е некоторые исследователи называют \"великим ускорением\", в котором процветающий средний класс привёл к появлению всплесков на графиках глобального ВВП, использованию земли под сельское хозяйство, производству бумаги, постройке дамб, владению автомобилями, международному туризму и другим признакам потребления. Уравнение Стефена и Гафни просто добавляет силы аргументу о том, что антропоцен начался вместе с цветными телевизорами.\nГафни признаёт выводы, следующие из таких заявлений – дескать, довольно маленькая часть людей отвечает за антропоцен и всё, что с этим связано. «Наше ключевое заключение в том, что основной причиной глобальных изменений служит производство и потребление товаров верхним и средним классом людей всего мира, – говорит он. — Определение антропоцена может привести к серьёзным социальным последствиям и обладает потенциалом менять человеческое восприятие, так же, как дарвиновская теория эволюции или гелиоцентрическая астрономия Коперника привели к сдвигам парадигм».\nЛюди не первые, кто изменяет мир, и, вероятно, они не станут последними. 2,3 млрд лет назад одноклеточные организмы, цианобактерии, выработали фотосинтез, вдыхали двуокись углерода и заполняли атмосферу кислородом. Их коллективный выброс газов иногда называют \"кислородным холокостом\", поскольку он задушил большой процент анаэробной жизни, доминировавшей на Земле. Цианобактерии были столь успешны, что их маленькие тельца в результате сгустились в огромные нефтяные резервы. И когда сформируется слой антропоцена, сожжённый из нефти углекислый газ станет причиной его красивого тёмного оттенка.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bf6"},"id":"8","title":"Международный союз электросвязи опубликовал предварительные спецификации технологии 5G","summary":"На днях Международный союз электросвязи (МСЭ) опубликовал спецификации технологии 5G","createdAt":{"$date":"2017-02-24T18:36:00.000Z"},"author":"marks","tags":["5g","сотовая связь"],"content":"5G — это разрабатываемое вот уже несколько лет новое поколение мобильной связи. В создании технологий, необходимых для работы сетей 5G, принимает участие несколько коммерческих компаний, научно-исследовательских организаций, разнообразных союзов и объединений. Несмотря на то, что разработка ведется уже давно, точного понимания того, что будет представлять собой 5G, не было даже в конце прошлого года. \nИ только на днях Международный союз электросвязи (МСЭ) опубликовал спецификации технологии 5G, правда, пока что предварительные. Согласно опубликованным данным, предполагается, что пропускная способность входящего канала связи для отдельной базовой станции 5G составит 20 Гбит/с. Для сравнения стоит привести аналогичный показатель для LTE — 1 Гбит/с. Кроме того, новая сеть должна поддерживать одновременное подключение 1 млн устройств на квадратный километр.\nВ 2014 году специалисты выделяли 3 концепции сети нового поколения:\nСуперэффективная мобильная сеть, которая обеспечивает лучшую производительность при более низких затратах. В общем случае, предполагалось, что стоимость передачи определенного объема данных должна снижаться примерно с той же скоростью, с какой растет объем передаваемых данных;\nСупербыстрая мобильная сеть, где предполагается наличие сети небольших «сот» нового поколения, которые размещаются плотнее, чем ячейки сети предыдущих стандартов. Сторонники этой концепции предполагали необходимость работы со спектром частот ниже 4 ГГц;\nКонвергентная оптоволоконно-беспроводная сеть, где используются волны миллиметрового диапазона (20-60 ГГц) c обеспечением пропускной способности отдельного канала вплоть до 10 Гбит/с.\nСпецификации, опубликованные МСЭ, показывают, что текущая концепция 5G сети включает в себя несколько элементов из трех основных вариантов, предложенных в 2014 году. Что касается самих технических данных, то информация о них размещена ниже. Все еще может поменяться, но уже не кардинально.\nПиковая пропускная способность сетей 5G\nСогласно опубликованным данным, пропускная способность входящего канала базовой станции составит 20 Гбит/с, исходящего — 10 Гбит/с. Это общие характеристики для одной «соты». В реальной ситуации пропускная способность канала станции будет поделена между каналами отдельных пользователей ячейки.\nПлотность соединения\nКак и говорилось выше, инфраструктура 5G должна поддерживать минимум 1 миллион подключенных устройств на площади в один квадратный километр. Здесь речь идет не только о мобильных телефонах, планшетах и прочих девайсах, но и об IoT-модулях, которыми оснащают сотни тысяч устройств. Если предположить, что модулями IoT 5G планируется оснащать даже светофоры, парковочные слоты и транспортные средства, то становится понятно, что 1 млн — это не так и много.\nМобильность\nКак и в случае с LTE и LTE-advanced, предполагается, что связь инфраструктура 5G будет поддерживать для подвижных абонентских устройств, перемещающихся со скоростью от 0 до 500 км/ч. В спецификациях указывается, что в пределах городской черты нет необходимости поддерживать связь с клиентскими устройствами, передвигающимися с высокой скоростью (в черте города суперавтобаны обычно не размещают). Но в пригородах и более удаленных от населенных пунктов местах инфраструктура должна поддерживать работу с устройствами пешеходов, умными автомобилями и терминалами, которые находятся в транспорте, двигающемся с высокой скоростью.\nЭнергоэффективность\nРазработчики стандартов связи для 5G считают, что в новом поколении связи необходимо использовать энергоэффективные модули. Такие системы должны быстро входить в режим экономии энергии и быстро «просыпаться», когда они нужны. Время выхода из спящего режима не должно быть меньшим 10 мс.\nЗадержка\nВ сетях нового поколения задержка не должна быть выше 4 мс. Это сильно отличается от 20 мс, допустимых в стандарте LTE. Для URLLC (ultra-reliable low latency communications) задержка не должна быть выше 1 мс.\nДорожная карта развития 5G (IMT-2020)\nСпектральная эффективность\nЗдесь речь идет о показателе, вычисляемом как отношение скорости передачи данных на 1 Гц используемой полосы частот (бит/с/Гц). Эта величина также характеризует скорость передачи информации в заданной полосе частот. Спектральная эффективность является показателем эффективности использования частотного ресурса и в некоторых случаях — показателем качества услуг. Здесь все близко к LTE-Advanced: 30 бит/Гц для входящего канала и 15 бит/Гц — для исходящего. Что касается MIMO, здесь предполагается работа схемы 8*4.\nРеальная скорость передачи данных для абонента\nЧто касается этой характеристики, то предполагается 100 Мбит/с на входящий канал и 50 — на исходящий. Это тоже близко к LTE-Advanced, хотя в случае 5G пропускная способность не должна слишком падать даже при неблагоприятных условиях (близость возвышенностей, плохая или хорошая погода и т.п.).\nПо плану, следующим шагом должен быть переход от спецификаций к реальным технологиям. Но как все это будет реализовано, пока не вполне ясно. С другой стороны, некоторые телекоммуникационные компании и производители электронных компонентов уже начинают прорабатывать 5G. Например, сразу три компании, Ericsson, Deutsche Telekom и SK Telecom запустили в тестовом режиме «первую в мире» сеть пятого поколения. Эта сеть, которую разработала Ericsson, соединила Германию (Deutsche Telekom) и Южную Корею (SK Telecom). Работают над схожими проектами и другие компании, так что будущее совсем близко.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bf7"},"id":"9","title":"Samsung представила мобильный чип Exynos 9 8895 — 8 ядер, 10 нм, гигабитный LTE","summary":"23 февраля 2017 года компания Samsung представила последнее поколение высокопрозводительных систем-на-кристалле (SoC, СнК) — Exynos 8895.","createdAt":{"$date":"2017-02-24T13:11:00.000Z"},"author":"alizar","tags":["процессор","samsung","exynos"],"content":"В то время как производители десктопных процессоров не могут освоить техпроцесс 10 нм, продолжая выпускать самые мощные процессоры по техпроцессу 14 нм, другие производители электроники уже преодолели этот технологический рубеж.\n23 февраля 2017 года компания Samsung представила последнее поколение высокопрозводительных систем-на-кристалле (SoC, СнК) — Exynos 8895, первую СнК, спроектированную Samsung по технологическому процессу с проектной нормой 10 нм (FinFET). Этот СнК опредялет технические характеристики самых мощных смартфонов ближайшего будущего, может быть, следующего Galaxy S8 (апрель). Похожие характеристики будут у чипа A11 в iPhone 8 (сентябрь), производством которого тоже по 10-нм техпроцессу занимается TSMC.\nКомпания Samsung давно выпускает мобильную линейку СнК Exynos, но в последнее время она явно застолбила за собой лидерские позиции в секторе high-end, что подтвердили последние модели микросхем Exynos 7420 и Exynos 8890, выполненные по техпроцессу 14-нм. Кстати, Exynos 8890 стал первым СнК, который основан на собственной микроархитектуре Exynos M1 от компании Samsung. По сравнению со стандартными архитектурами ARM в неё внесён ряд изменений и улучшений.\nExynos 8895 продолжает эту традицию, он тоже базируется на собственной микроархитектуре и ядрах M1.\nПо названию Exynos 8895 понятно, что он не должен сильно отличаться от Exynos 8890, но всё-таки ряд приятных изменений имеется. Самое главное, конечно, это переход на техпроцесс 10 нм. А в технических характеристиках бросается в глаза радикальное улучшение процессора изображения (ISP). Обработка сигнала с фронтальной камеры увеличена с разрешения 13 МП сразу до 28 МП. Основная камера «подросла» с 24 МП до 28 МП, появился режим «двойной камеры». Улучшились характеристики модема, который теперь поддерживает приём данных со скоростью до 1 Гбита/c (LTE Cat16) — прямо как будущий LTE-модем Qualcomm X20.\nБлагодаря переходу на техпроцесс 10 нм LPE удалось добиться роста производительности на 27% и снизить энергопотребление на 40% относительно 14 нм. Правда, компания не указывает явно, что улучшения по этим двум параметрам достигнуты одновременно. Более реалистичной кажется оценка о повышении производительности или снижении энергопотребления.\nВосьмиядерный Exynos 8895 содержит четыре высокопроизводительных ядра «второго поколения» (M2?) и четыре энергоэффективных ядра. Сейчас пока неизвестно, какие конкретно изменения внесены в ядро «второго поколения» по сравнению с M1.\nПоcкольку энергоэффективные ядра Cortex-A53 тоже производятся по 10-нм техпроцессу, то при сохранении прежней архитектуры они должны стать совсем крошечными по размеру — ведь даже на 14 нм они были меньше 1 мм².\nExynos 8895 станет первой СнК от Samsung с поддержкой гетерогенной системной архитектуры (Heterogeneous System Architecture, HSA). Это значит, что модули CPU и GPU работают на одной шине с общей памятью, что улучшает производительность СнК и облегчает программирование. Больше не требуется двигать данные из памяти CPU в память GPU и обратно.\nSamsung внедрила в микросхему более энергоэффективную память LPDDR4x, которая является расширением стандарта LPDDR4. Её энергопотребление снижено на 20% за счёт уменьшения выходного напряжения I/O VDDQ на 45%, то есть с 1,1 В до 0,6 В. Память LPDDR4x только начали производить, её поддерживает также недавно анонсированный Qualcomm Snapdragon 835.\nИз других улучшений Samsung упоминает новый видеодекодер Multi-Format Codec (MFC), который поддерживает самые последние видеоформаты HEVC и VP9 со скоростью декодирования 120 кадров/с на максимальном разрешении 4K UHD.\nВ конце концов, Samsung интегрировала в Exynos 8895 «подсистему безопасности с отдельным вычислительным модулем» для аутентификации (распознавание радужной оболочки глаза, отпечатков пальцев), мобильных платежей и тому подобного. По описанию она звучит как Apple Secure Enclave.\nSamsung объявила, что массовое производство Exynos 8895 уже началось, так что выход Galaxy S8 явно не за горами.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bf8"},"id":"10","title":"Учёные меняют лабораторных мышей на устройства «мини-мозг на чипе»","summary":"За последние пять лет исследователи создали большое количество разных микро-органов, растущих в чашках Петри, от маленьких кишочков до печени лилипутского размера.","createdAt":{"$date":"2017-02-24T12:54:00.000Z"},"author":"SLY_G","tags":["биотехнологии","мыши","мозг"],"content":"Два года назад Дайэн Хофман-Ким [Diane Hoffman-Kim] вырастила свой первый мозг-шарик. Она начала с нескольких нервных клеток мыши, размещённых в специальной чашке Петри с неприлипающей поверхностью. Клетки, которым не за что было держаться, кроме как друг за друга, выросли в сферу диаметром менее миллиметра: мини-мозг. Биоинженеры с тех пор вырастили тысячи таких органоидов, в которых нейроны ведут себя активно и посылают электрические сигналы. Единственный их минус – они не живые. Без самостоятельного снабжения кровью они не выживут, если о них не заботиться.\nА затем в прошлом году один из студентов Хофман-Ким заметил кое-что, незамеченное ранее: её мозги-шарики спонтанно выращивали кровеносные сосуды.\nЭто переплетение из трубочек отмечает начало простейшей кровеносной системы. «Их можно назвать новичками», – говорит Хофман-Ким. Её мини-мозги не в состоянии прокачивать свою кровь – для этого нужно сердце – но это не останавливает Хофман-Ким от попыток приблизить их к состоянию самостоятельной жизни. Она работает с коллегами из Брауновского университета над подключением мини-мозгов к мини-кровеносной системе: целые ряды шариков закреплены на чипах, подключенных к материнской плате с подачей крови.\nЗа последние пять лет исследователи создали большое количество разных микро-органов, растущих в чашках Петри, от маленьких кишочков до печени лилипутского размера. Одновременно был достигнут прогресс и в создании биочипов: небольшие системы размером с USB-флэшку, содержащие один или несколько слоёв живых клеток, усеянные биосенсорами и микроканалами для подвода жидкостей. Эти двумерные чипы удобны для тестирования, к примеру, реакции клеток лёгкого на токсин, но слишком упрощены для того, чтобы по-настоящему имитировать работу органа целиком. И тут на сцену выходят такие органоиды, как мозги-шарики Хофман-Ким. Впервые двумерные биочипы скрещены с трёхмерными мини-органами – и вместе они составляют наилучший на сегодня симулятор органа.\nПо идее, используя такие установки, учёные смогут взять, допустим, несколько клеток вашей кожи, вырастить небольшие версии всех ваших органов, и разместить их на чипе. Затем доктора смогут проверить действие лекарств для имеющихся у вас болезней – не на мышах, а на вашей миниатюрной версии. «Это откроет новую эру в персонализированной медицине», – говорит Али Хадемхосейни [Ali Khademhosseini], биоинженер из гарвардского Института биоинженерии им. Вииса, работавший над созданием мини-органов и биочипов последние десять лет.\nВ работе, готовящейся к публикации, описано, как Хадемхосейни с командой создали несколько чипов, объединяющих органоиды печени и клетки рака при помощи петел из трубочек. Они прокачали через систему лекарство от рака, и отслеживали, убивает ли оно раковые клетки, и выживают ли при этом клетки печени. Таким образом возможно дозировать лекарство с тем, чтобы максимизировать антираковое воздействие, при этом не повреждая печень.\nТакой способ проверки лекарств поможет разрабатывать новые методы терапии быстрее и дешевле. DARPA делает крупные инвестиции в такие исследования, особенно упирая на лечение людей от последствий воздействия ядерного и биологического оружия, поскольку это тяжело тестировать на людях. Это может означать конец эпохи тестирования лекарств на животных. Сейчас все новые лекарства должны проходить проверку на токсичность на животных до того, как разработчик сможет подать заявку на тестирование на людях. Это особенно важно для лечения болезней, специфичных для людей, поскольку в таких случаях животные модели не работают.\nЭнтеровирусы каждый год становятся причиной 10 млн заражений, а для младенцев они представляют смертельную опасность. При этом ни один из 71 штаммов вируса не заражает мышей или крыс. «Если подумать, практически всё, что нам известно об инфекциях, основано на опытах с мышами», – говорит Кэролин Койн [Carolyn Coyne], микробиолог из Питтсбургского университета. Поэтому Койн создала микро-кишки. В работе, опубликованной в прошлом месяце, описано, как её команда заставила стволовые клетки человека сформировать семь различных типов клеток, из которых состоят кишки. Как и в случае мини-мозгов Хофман-Ким, клетки Койн самоорганизовались в комочки прото-кишков, включая ворсинки [выступs на поверхности слизистой оболочки – прим. перев.]. Некоторые из энтеровирусов поражают только определённые виды клеток, используя их для проникновения в кровоток, где они могут причинить максимум вреда.\nПри этом, одних только мини-кишков было недостаточно для того, чтобы понять, почему вирус атакует конкретные клетки. Койн подозревает, что дело может быть в микрофлоре кишечника. Проверить гипотезу ей пока не удалось, поскольку большинство микробов кишечника не живут в чашке Петри с её мини-кишечником дольше пары дней. Но они могли бы прожить дольше, находясь на чипе…","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bf9"},"id":"11","title":"Ученые потеряли единственный в мире образец металлического водорода","summary":"В прошлом месяце команда ученых из Гарвардского университета во главе с Исааком Силвера (Isaac Silvera) и Ранга Диасом (Ranga Dias) заявила о получении металлического водорода.","createdAt":{"$date":"2017-02-24T12:02:00.000Z"},"author":"marks","tags":["физика","неудача","потрачено"],"content":"В прошлом месяце команда ученых из Гарвардского университета во главе с Исааком Силвера (Isaac Silvera) и Ранга Диасом (Ranga Dias) заявила о получении металлического водорода. Для перевода газа в металлическое состояние потребовалось использовать алмазные наковальни, усиленные оксидом алюминия. Благодаря этому удалось достичь огромного давления в 495 ГПа. \nПри этом специалисты не успели выяснить, какую форму металла они получили — твердую или жидкую. Сами они считают, что смогли получить жидкую форму металлического водорода. К сожалению, теперь выяснить этот момент не представляется возможным, поскольку один из алмазов наковальни разрушился в ходе проведения очередных измерений, а образец водорода пропал.\nВозможно, этот образец просто потерялся, поскольку его размеры очень малы: диаметр составляет всего 10 микрометров. Это примерно в пять раз меньше диаметра волоса человека. Так что вполне может быть, что сейчас металлический водород лежит где-то в лаборатории и ждет, пока его найдут.\nТакже может быть, что после разрушения алмазной оболочки образец испарился. Теория предсказывает, что металлический водород должен быть стабильным. Но как все обстоит на самом деле, неясно. Если в этой части теория ошибается, металлический водород, полученный в лаборатории, вполне мог быть нестабильным и при снижении давления просто испариться. Неприятность произошла более недели назад, за несколько минут до упаковки алмазной наковальни для отправки в измерительную лабораторию Argonne National Laboratory, которая располагается в Чикаго.\n«Он пропал. Водород либо где-то лежит, либо он снова превратился в газ. Мы не знаем», — говорит один из ученых. Он также заявил, что расстроен случившимся, но сейчас команда готовит новую наковальню, которая будет более прочной. «Мы проведем новый эксперимент для проверки того, сможем ли мы достичь того же давления, что в и первый раз, получив металлический водород», — говорит он.\nВ то, что группа ученых из Гарварда получила металлический водород, поверили не все специалисты. Для подтверждения этого необходимо было провести ряд тестов, которые, к сожалению, проведены не были, включая проверку электропроводности материала. Все металлы — проводники электричества, и если бы оказалось, что образец в алмазной наковальне тоже его проводит, в получении металлического водорода удалось бы убедить почти все научное сообщество. После того, как образец был утерян, в его получении стали сомневаться многие физики. Ряд ученых не были убеждены в удаче коллег из Гарварда и до инцидента, а после него скептиков стало гораздо больше.\n«Статья неубедительна», — говорит о публикации коллег Поль Лубер (Paul Loubeyre), физик из французского Комиссариата по атомной энергии.\nПо словам Сильверы, они с коллегами как раз собирались отправить образец для обследования при помощи синхротрона в Аргоннской национальной лаборатории, это старейший национальный исследовательский центр Министерства энергетики США. Перед отправкой образца ученые решили измерить давление в алмазной наковальне еще раз, при помощи инфракрасного лазера. Но если прежде измерения такого типа проводились без проблем, то сейчас все пошло не так. «Как только мы включили лазер, алмазы разрушились. Один из них превратился в пыль», — объясняет Сильвера.\n«Это одна из проблем, которые уже случались в других командах, но мы считали, что нас это не коснется. Мы уже проводили измерения прежде, но, как видим, что-то со временем изменилось. Вероятно, в алмазах появились дефекты, возможно, это была диффузия водорода. Мы не знаем, что случилось», — заявил Сильвера.\nВ то же время, он уверен, что может получить больше металлического водорода — если не в следующем эксперименте, то очень скоро. Кроме того, ученый уверен, что повторение эксперимента убедит некоторых скептиков.\n«То, что образец исчез, ничего не говорит о валидности образца. Каждый, кто работает с высоким давлением, знает, что время от времени подобное случается. Важно то, что мы провели измерения отражательной способности образца, это надежно», — говорит физик. — «Поэтому случившееся не катастрофа, мы просто разочарованы из-за того, что не можем больше проводить измерения образца».\n«Скептики будут всегда, мой им совет — попробовать повторить эксперимент — мы показали все, что мы делаем с высоким давлением, получив в лаборатории металлический водород, поэтому и другие команды смогут сделать это», — считает Сильвера. — «Это научный метод и это лучше, чем просто подвергать сомнению наши результаты».\nНа следующем этапе ученые собираются использовать синтетические алмазы другого типа, которые, предположительно, будут более стабильными. По их словам, из случившегося сделаны выводы, поэтому образец не будет находиться в лаборатории так долго, его отправят на изучение практически сразу.\n«Это может случиться, если держать образец слишком долгое время, тогда его целостность каким-либо образом может быть нарушена, так что следующий раз, после достижения высокого давления, мы проведем измерения так быстро, как только сможем», — говорят ученые.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bfa"},"id":"12","title":"NASA ещё немного приоткрыла щелку к инопланетянам","summary":"Вчера NASA обнародовала данные об очередной партии открытых землеподобных планет, благодаря все совершенствующейся аппаратуре наблюдений.","createdAt":{"$date":"2017-02-22T21:07:00.000Z"},"author":"Anrewer","tags":["NASA","астрономия","космос","экзопланеты"],"content":"В нашей Солнечной системе потенциально пригодных для жизни планет три — наша, Марс и Венера. На двух последних всё испортила атмосфера. Но в других планетных системах может и не испортить. \nВчера NASA обнародовала данные об очередной партии открытых землеподобных планет, благодаря все совершенствующейся аппаратуре наблюдений. Планетарная система TRAPPIST-1 на расстоянии 40 световых лет от нас.\nОтобранные учеными для наблюдения планеты подобны Земле, конечно, только по размерам и то очень приблизительно. Такие условия, как достаточность энергии для зарождения жизни и минимальный комфорт для развития разума выполняются гораздо реже. В целом по Галактике только по одному из параметров — по «достаточности энергии» подходит примерно 6% землеподобных планет. Атмосферные, вулканические и магнитные факторы оценить гораздо сложнее. Данных мало. Но, чем больше подтверждается число таких планет, тем больше шансов на поиски инопланетян.\nИскать есть где. Только в одном Млечном пути от 5 до 20 миллиардов планет, подходящих для фантазий на тему той или иной формы жизни. Конечно они далеко и мы их пока не видим, как до конца 1980-х не видели и более близких «соседей». Первую и ближайшую к нам пригодную для жизни планету — Kepler-22 b в созвездии Лебедь — увидели в 2011 году. До нее 650 световых лет.\nТеперь соседей уже видим всё чаще. Кандидатов в жизнепригодные по наблюдениям со спутников и расчетным величинам уже несколько тысяч, но это неофициально. Такие данные принято подтверждать телескопами на Земле. Подтверждено «кандидатов в кандидаты» чуть больше 3 с половиной тысяч. И число их постоянно растет. Индекс жизнепригодности планет и их каталог тут.\nОсобенность вчерашнего обнародования данных от NASA в количестве планет, подобных Земле внутри одной планетарной системы. Их там семь, из которых на шести могут быть условия для жизни, а на трех так даже возможны и океаны воды. Спектр этой планетарной системы наблюдают уже несколько лет. Она довольно удачно расположена для наблюдений и довольно близко. Но нужен более мощный телескоп. С нынешним долгое время ошибались, к примеру, не только в атмосфере, но и в количестве планет. Ждали три, увидели семь. Запуск нового «Европейского чрезвычайно большого телескопа» планируется через 5 лет в Чили. Зеркало его позволит собирать в 15 раз больше света, чем у любого из нынешних аналогов.\nЗвезда, вокруг которой вращаются эти планеты, маленькая. Примерно 1/16 от нашего Солнца. Сами планеты при этом от Земли по размерам отличаются не так сильно. Просто у подобных тусклых и холодных звезд зона обитания расположена намного ближе, чем у нашего Солнца. И такой звездной «мелочевки» полно во Вселенной. Это плюс. А минус в том, что «красные карлики» при своем зарождении радиационными вспышками обычно губят шансы на жизнь в своей планетарной системе. TRAPPIST-1 система молодая, вращаются планеты быстро, повернуты одной стороной к звезде и астрономы сами не очень верят в наличие там жизни.\nНо там красиво, точнее непривычно…","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bfb"},"id":"13","title":"Китайская фабрика заменила 90% сотрудников роботами и получила прирост производительности в 250%","summary":"В наше время технологии развиваются очень быстро. В числе прочих сфер, где прогресс сильно заметен — промышленная робототехника.","createdAt":{"$date":"2017-02-22T10:07:00.000Z"},"author":"Madrobots","tags":["робототехника","китай","будущее"],"content":"В наше время технологии развиваются очень быстро. В числе прочих сфер, где прогресс сильно заметен — промышленная робототехника. Специалисты создают все новых роботов, которые во многих случаях гораздо эффективнее людей. Один из примеров — замена сотрудников одним из промышленных предприятий Китая в городе Дунгуань. Из 650 человек, работавших на фабрике, руководство оставило лишь 60, заменив остальных роботами. Оставшиеся сотрудники выполняют лишь работу по обслуживанию своих «коллег» из металла. Другими словами, в обязанности персонала входит обеспечение непрерывности производственного процесса. Если какой-то из аппаратов начинает сбоить, его быстро приводят в чувство. \nФабрика, о которой идет речь, принадлежит компании Changying Precision Technology Company. Она занимается производством мобильных телефонов, используя для этого автоматические линии сборки. Ранее эту же работу выполняли люди, сидевшие вдоль конвеера (аналогичную картину можно увидеть на фотографиях с тех же фабрик Foxconn). Сейчас на каждом ключевом этапе сборки мобильных устройств размещены роботизированные манипуляторы, каждый из которых выполняет ограниченный набор операций. На предприятии в автономном режиме работают даже транспортные средства, используемые для перевозки грузов.\n60 человек обслуживающего роботов персонала — это довольно много. С другой стороны, сами манипуляторы — достаточно сложные системы, за которыми необходимо присматривать. Сейчас все идет гладко, так что руководитель предприятия даже подумывает о том, чтобы сократить число персонала с 60 до 20 человек.\nЭффект замены людей на роботов не замедлил проявиться: производительность предприятия сразу выросла на 250%. А вот количество бракованных деталей резко снизилось — с 25% до 5%. С точки зрения бизнеса, руководство поступило правильно, заменив неквалифицированный персонал, ведь 25% брака — это очень много.\nКомпания Changying Precision Technology Company — не единственная, кто постепенно заменяет своих работников-людей на роботов. Еще в 2015 году компания Shenzhen Evenwin Precision Technology заявила о намерении заменить 90% своих сотрудников (а это, без малого, 1800 человек) роботами. И руководство постепенно реализует свои планы. Сейчас на предприятиях этой организации работает около 200 человек, которые, как и в случае, описанном выше, ведут наблюдение за роботами. Если с роботом возникает какая-то проблема, ее решает человек. Но все рабочие процессы здесь выполняют машины. В целом, в Южном Китае более 1500 предприятий постепенно заменяют своих сотрудников на роботов, с течением времени эта тенденция лишь усиливается.\nПонятно, что китайцы, лишившиеся рабочих мест из-за роботов, не слишком довольны случившимся. Поэтому в регионе регулярно проводятся забастовки и митинги. Правда, результатов эти мероприятия пока не дали.\nПравительство Китая не так давно представило план по развитию промышленного сектора страны вплоть до 2025 года. В этом плане, в частности, упоминается необходимость роботизации производства во всей Поднебесной. Эксперты, в свою очередь, прогнозируют, что к 2025 году примерно треть видов работ на предприятиях, которые сейчас выполняются людьми, будут выполняться роботами, умными устройствами и специализированным программным обеспечением. Это касается не только Китая, но и всего мира.\nСигнулярность все ближе.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bfc"},"id":"14","title":"На АЭС во Франции произошел взрыв. Реактор не пострадал","summary":"В машинном зале АЭС «Фламанвиль» на северо-западе Франции прогремел взрыв, сообщает агентство «РИА Новости» со ссылкой на местное издание Quest France.","createdAt":{"$date":"2017-02-09T14:55:00.000Z"},"author":"ragequit","tags":["АЭС","авария","энергетика"],"content":"В машинном зале АЭС «Фламанвиль» на северо-западе Франции прогремел взрыв, сообщает агентство «РИА Новости» со ссылкой на местное издание Quest France. Начавшийся после взрыва пожар был потушен сотрудниками станции.\nЧП произошло в машинном зале первого энергоблока. По сообщениям властей, работа реактора была остановлена, хотя взрыв никак не затронул рабочую зону АЭС. «Первое, что нужно отметить, — нет никакого риска выброса, это не радиоактивная зона. Пока причины инцидента устанавливаются, но наиболее вероятная версия — короткое замыкание», — сообщил представитель властей.\n«Подобная авария может произойти в машинном зале на любой электростанции. Но так как это АЭС, то общественность сразу паникует, а многие пытаются использовать для критики атомной энергетики», — прокомментировал ситуацию эксперт в области ядерной и радиационной безопасности Михаил Рылов.\nФранция является самым зависимым от атомной энергетики государством мира. Более 76% вырабатываемой в стране электроэнергии приходится на АЭС. В общей сложности на территории Франции находится 58 действующих АЭС суммарной мощностью 63,1 ГВт. Подавляющее большинство атомных станций было построено в 70-х 80-х годах ХХ столетия. Кроме удовлетворения внутренних нужд, Франция экспортирует электроэнергию (излишки производства составляют 20%), занимая по этому показателю первое место в мире. Власти страны давно подвергаются критике со стороны «зеленых» за большое количество старых атомных станций, аварии на которых могут привести к катастрофе.\nАЭС «Фламанвиль» была введена в эксплуатацию в декабре 1985 года, находится на северо-западе страны в регионе Нижняя Нормандия. АЭС состоит из двух энергоблоков мощностью 1300 МВт каждый. Третий энергоблок станции, «Фламанвиль-3», мощностью 1650 МВт, с 2007 года находится в стадии строительства, а сроки ввода его в эксплуатацию неизвестны.\nНа АЭС установлены водно-водяные ядерные реакторы, которые используют в качестве замедлителя и теплоносителя обычную воду. Данный тип реакторов считается одним из наиболее надежных ввиду большого опыта по их строительству и широкого применения.\nНеобходимо отметить, что сегодняшний взрыв и последующий пожар на «Фламанвиле» — это не первое ЧП на этой АЭС. 25 октября 2012 года в одном из реакторов произошла утечка радиации. В момент инцидента реактор был на обслуживании, на последней стадии запуска, благодаря чему был экстренно остановлен, а ситуация взята под контроль. Отмечается, что утечка была столь незначительна, что даже не потребовалась эвакуация персонала.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bfd"},"id":"15","title":"Google опустил в выдаче сайты с полноэкранными мобильными баннерами","summary":"Компания Google официально объявила об изменении в алгоритме ранжирования поисковой выдачи с учётом доступности мобильной версии сайта.","createdAt":{"$date":"2017-01-20T18:02:00.000Z"},"author":"alizar","tags":["google","мобильная реклама"],"content":"10 января 2017 года стал грустным днём для рекламщиков. В этот день компания Google официально объявила об изменении в алгоритме ранжирования поисковой выдачи с учётом доступности мобильной версии сайта. Если при загрузке мобильной версии на экране смартфона возникает полноэкранный баннер, то этот будет сайт понижен в поисковой выдаче на мобильном устройстве.\nGoogle периодически проводит настройку и доработку своего алгоритма ранжирования, который раньше называли PageRank, потому что он учитывал «ранг» страницы по количеству входящих ссылок. Теперь в учёт принимаются ещё и сотни других факторов.\nПессимизация мобильных сайтов с рекламой — один из нескольких сотен сигналов, которые Google учитывает при ранжировании. Компания подчёркивает, что содержание страницы по-прежнему остаётся сильным сигналом, так что страница может ранжироваться довольно высоко даже при наличии промежуточной рекламы, но с релевантным контентом (например, как у журнала Forbes).\nО грядущих изменениях было предварительно объявлено ещё в августе 2016 года. Тогда Google привела примеры способов размещения рекламы, за которые сайты будут пессимизироваться.\nВсплывающее окно поверх страницы, которое закрывает содержимое основного контента и появляется немедленно при открытии страницы после перехода из результатов поиска или через некоторое время после просмотра страницы.\nДемонстрация промежуточной рекламы, которую пользователь должен «пропустить», прежде чем получит доступ к странице с полезным контентом.\nИспользование такого расположения рекламы, в котором верхняя часть рекламного баннера с кнопкой закрытия сливается по фону с оригинальным контентом сайта, над которым отображается баннер. Так кнопка для закрытия рекламы менее заметна.\nGoogle считает такие объявления «вредными», потому что они затрудняют чтение полезной информации, которую пользователь нашёл с помощью поиска в Google. Другими словами, эти баннеры ухудшают качества поиска Google. Человек по наводке поисковой системы переходит на страницу — и видит там не контент, а навязчивую рекламу. Именно поэтому Google начала опускать эти сайты в поисковой выдаче.\nДля сравнения, вот примеры всплывающих окон перед загрузкой основного контента, за которые мобильные сайты не будут пессимизироваться:\nПромежуточная реклама, которая отображается в соответствии с требованиями законодательства. Например, для проверки возраста пользователя или для получения разрешения на использование куков (закон Евросоюза).\nДиалоговые окна для входа на сайт, содержимое которого не является публично доступным. Например, это может быть личная информация вроде электронных писем или проиндексированный контент за платной заглушкой на сайте СМИ. (Примечание: не совсем понятно, пессимизируются ли сайты, которые требуют авторизации для доступа к базового контенту без видимой причины, как Linkerdin, Quora и Pinterest).\nБаннеры, которые занимают разумную долю экранного пространства и легко закрываются. Так, баннеры для установки приложений, которые демонстрируются в браузерах Safari и Chrome, являются примерами баннеров, занимающих разумную долю экранного пространства.\nРанее Google проверяла мобильную версию сайта на предмет полноэкранного баннера, который предлагает пользователю установить мобильное приложение для «более удобного» чтения сайта. Такие сайты пессимизировались. Теперь компания решила, что пришло время расширить список вредной «промежуточной рекламы». Теперь, чтобы избежать дубликации сигналов в алгоритме ранжирования, специальная проверка на предложение установить мобильное приложение вообще исчезла.\nХотя новые правила ранжирования вступили в действие 10 января 2017 года, по каким-то причинам до сих пор специалисты не заметили особенного влияния новых способов пессимизации. Возможно, так произошло, потому что Google оставила веб-мастерам значительный период для адаптации к новым правилам и исправления ситуации. Либо это может быть по техническим причинам. Есть много технических способов демонстрации пользователю промежуточной рекламы и всплывающих баннеров. Возможно, боты Google ещё не научились детектировать все эти способы. Им потребуется некоторое время.\nВ целом инициативу Google можно приветствовать. Это уже не первый случай, когда интересы поисковой компании и большинства обычных пользователей полностью совпадают. Задача поискового сайта — предоставить максимально точную информацию по запросу пользователя максимально удобным способом. У пользователя такая же цель. Промежуточные рекламные баннеры тут совершенно ни к чему.\nЛюбопытно, что эта пессимизация сайтов со всплывающей рекламой затронула некоторые крупные издательские дома. Да и вообще стала неприятной новостью для СМИ. Представители издательского бизнеса, специально или случайно, сразу нанесли ответный удар. По совпадению, именно сейчас газета The Wall Street Journal опубликовала результаты анализа 25 000 поисковых запросов на Google, по итогам которых обвинила Google в продвижении собственных продуктов в поисковой выдаче. Как известно, Google получает львиную часть дохода от рекламы, но свои собственные продукты продвигает бесплатно, причём размещает на верхних позициях рекламных блоков — это смартфоны Pixel, умные термостаты Nest, хромбуки и другие продукты. В 2010 году представители Google объяснили свою позицию по этому вопросу. Они сказали, что размещать рекламу своих продуктов в поисковой выдаче вполне нормально для поисковой компании, точно так же газеты размещают на своих страницах рекламные модули с предложением оформить подписку на газету, а телеканалы рекламируют свои передачи во время рекламных пауз.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bfe"},"id":"16","title":"Софт ИИ обучается делать ИИ: учёные сообщают об успехах в самообучении искусственного интеллекта","summary":"В одном из экспериментов исследователи ИИ из подразделения Google Brain разработали программу, которая проектировала нейронную архитектуру нейросети таким образом, чтобы та показывала максимально высокие результаты в распознавании речи.","createdAt":{"$date":"2017-01-22T10:41:00.000Z"},"author":"alizar","tags":["ии","нейронные сети","машинное обучение"],"content":"Ключевой элемент для возникновения технологической сингулярности — запуск неконтролируемого цикла самосовершенствования ИИ, где каждое новое более умное поколение ИИ будет появляться быстрее предыдущего. Согласно теории сингулярности по Вернору Винджу, в результате взрывного развития интеллекта в цикле экспоненциального самосовершенствования появится сверхинтеллект, который намного превзойдёт возможности человеческого разума и по сути будет непонятен для него. Называются разные примерные даты наступления сингулярности, исходя из экстраполяции технологического прогресса. Рей Курцвейл считает, что это произойдёт примерно в 2045 году (хотя он не считает обязательным экспоненциальное самосовершенствование ИИ), а среднее медианное значение по опросу экспертов по сильному ИИ — 2040 год.\nВполне возможно, что сингулярность наступит раньше прогнозируемого. Инженеры из компании Google и разработчики систем ИИ из других компаний сообщают об успехах, которых удалось добиться в ключевом направлении — создании систем ИИ, предназначенных для проектирования других систем ИИ.\nВ одном из экспериментов исследователи ИИ из подразделения Google Brain разработали программу, которая проектировала нейронную архитектуру нейросети таким образом, чтобы та показывала максимально высокие результаты в распознавании речи. Спроектированная программным методом система показала лучший результат, чем созданные человеком нейросети.\nИздание MIT Technology Review рапортует, что в последние месяцы об успехах по созданию систем ИИ для проектирования других систем ИИ сообщили несколько исследовательских коллективов, в том числе из некоммерческой организации OpenAI (финансируется Илоном Маском), Массачусетского технологического института, Калифорнийского университета в Беркли, а также ещё одного подразделения по искусственному интеллекту в компании Google — DeepMind. Очевидно, это направление научных исследований считается одним из самых перспективных, многие хотят преуспеть в нём.\nПо мнению MIT Technology Review, такие разработки в первую очередь преследуют экономическую цель. Создание программы для проектироания приложений ИИ значительно ускорит применение подобных технологий в разных сферах экономики. Сейчас многие компании не могут себе позволить внедрить систему ИИ, потому что в штате нет специалиста с такой компетенцией. Банально, эксперты по ИИ в большом дефиците. А ведь нейросети можно применять практически в огромном количестве приложений: в автомобильной промышленности, в банковской сфере, в телекоммуникациях, в системах безопасности и видеонаблюдения, в самых разных потребительских продуктах для распознавания речи и жестов, машинного зрения и т.д.\nРазработка систем ИИ программными методами позволит заменить часть этих дефицитных программистов.\nВажно ещё и то, что ИИ разрабатывает нейросети более эффективные, чем человек, поэтому внедрение таких программ имеет смысл даже там, где раньше работали живые разработчики.\nНа эту тему рассуждал недавно Джефф Дин (Jeff Dean), руководитель исследовательской группы Google Brain. В своём выступлении на конференции AI Frontiers в Санта-Кларе (Калифорния) он предположил, что часть таких программистов можно заменить программным обеспечением, потому что в данный момент компаниям приходится платить очень высокие деньги и зарплату этим специалистам, которых крайне не хватает.\nНапример, в научной статье \"Learning to reinforcement learn\" от DeepMind описан набор экспериментов для самообучения ИИ, который исследователи называют «глубокое мета-обучение с подкреплением» (deep meta-reinforcement learning). Суть заключается в том, чтобы использовать стандартное обучение с подкреплением нейросети с обратной связью таким образом, чтобы эта рекуррентная нейросеть разработала собственную свободную от внешних шаблонов процедуру обучения с подкреплением для другой рекуррентной нейросети.\nЭксперименты показали, что нейросеть второго порядка, созданная усилиями первой нейросети, в некоторых случаях демонстрирует эффективность и качества, которыми не обладает нейросеть первого порядка.\nВсего в научной работе DeepMind описано семь таких экспериментов. Как обычно, они проводят их в пространстве компьютерных игр. По мнению исследователей, подобные агенты ИИ, созданные с помощью других программ ИИ, способны быстрее адаптироваться к новым задачам, используя полученные ранее знания на схожих задачах. Эксперименты показали также, что результат обучения ИИ второго порядка можно считать непредсказуемым: его архитектура не зависит от архитектуры ИИ первого порядка и может сильно отличаться от неё. В частности, ИИ второго порядка способен использовать особенности среды, о которых не знали или не которые не учитывались самими разработчиками.\nСпециалисты DeepMind считают, что их эксперименты с глубоким мета-обучением с подкреплением имеют значение и в изучении человеческого мозга, в частности, они «обеспечивают интегративный фреймворк для понимания соответствующих ролей допамина и префронтальной коры головного мозга в биологических процессах обучения с подкреплением».\nИдея самообучения ИИ выдвигалась и раньше, но до сих пор учёным не удавалось продемонстрировать настолько впечатляющих результатов. Например, один из пионеров в этой области, профессор Йошуа Бенжио (Yoshua Bengio), говорит, что такие эксперименты требуют слишком больших вычислительных мощностей, так что до последнего времени они не имели практического смысла. Например, в опытах Google Brain для работы программного обеспечения, которое проектирует систему ИИ для машинного зрения, использовалось 800 высокопроизводительных графических процессоров.\nИсследователи из Массачусетского технологического института планируют опубликовать исходный код программы, которую использовали в своих экспериментах. Возможно, со временем использование таких инструментов будет иметь экономический смысл и оно снизит нагрузку на специалистов, которые разрабатывают модели для обработки данных. Высококвалифицированные программисты смогут отвлечься от кодинга и сконцентрироваться на идеях более высокого порядка.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292bff"},"id":"17","title":"Массовые поломки часов на спутниках «Галилео»","summary":"На 18 спутниках, которые уже на орбите, 9 устройств отсчета времени прекратили работу.","createdAt":{"$date":"2017-01-19T01:50:00.000Z"},"author":"Nubus","tags":["космонавтика","отказ"],"content":"Бортовые атомные часы, отвечающие за навигационно-спутниковый сигнал, отказывают в сети спутников «Галилео» с угрожающей скоростью.\nНа 18 спутниках, которые уже на орбите, 9 устройств отсчета времени прекратили работу.\nТри из них традиционные рубидиевые атомные часы; шесть остальных более точные водородные мазеры, которые были разработаны для того чтобы дать системе «Галилео» улучшенную точность по сравнению с Американской системой GPS.\nПроект «Галилео» был объявлен полностью запущенным в Декабре. Однако в нем все еще недостаточно спутников чтобы сформировать полностью рабочее спутниковое созвездие и теперь должно быть принято решение: продолжать ли запуски во время работы над данной проблемой.\nПрофессор Иоганн-Дитрих Вернер, директор Европейского Космического Агентства, высказался на встрече с репортерами: «Все сейчас задают вопрос: должны ли мы отложить следующий запуск до выяснения причин данной проблемы, или мы должны запускать? Вы можете дать ответы на оба вопроса одновременно. Вы можете сказать чтобы мы подождали пока мы найдем решение, но это значит что если остальные часы начнут отказывать то мы сократим возможности „Галилео“. Но если мы начнем запуски, мы как минимум сохраним, если не увеличим возможности, но тогда мы берем на себя риск того что систематическая проблема не будет учтена. Сейчас мы обсуждаем наши дальнейшие шаги.»\nВсе еще действуют\nКаждый спутник «Галилео» несет двое рубидиевых часов и двое часов на водородных мазерах . Такой набор часов позволяет спутнику работать даже после отказа одного из них. Все 18 спутников продолжают работать на орбите, но один из них уже имеет только 2 рабочих часов. Большинство мазеров (5) отказали на спутниках которые были посланы на орбиты для подтверждения работы системы, в то время как все три отказа рубидиевых часов были на спутниках, которые были посланы позже, для заполнения созвездия.\nВ сообщении агентства, которые было сделано позднее в среду, были изложены дополнительные факты.\nБыла названа возможная причина отказа рубидиевых часов «все проблемы имеют один и тот же сценарий, который был связан с возможным коротким замыканием в цепи, и возможно одной из процедур тестирования, которая была проведена на земле»\nТак-же в нем говорится что отказы мазерных часов исследованы лучше, и названы две наиболее вероятных причины, вторая из которых вызвала наибольшее сожаление. ЕКА сообщило что второй сценарий был «в том факте что когда некоторые рабочие водородные мазеры выключены на долгое время, они не стартуют из за изменения параметров системы.»\nБыли приняты меры по предотвращению будущих проблем. Они включают в себя изменение того как часы будут работать на орбите. Часы которые готовятся к запуску скорее всего будут переделаны и следующие заказы на часы будут включать в себя изменения дизайна.\nПассивные мазерные часы в «Галилео» имеют погрешность в одну миллиардную секунды в день или одну секунду в три миллиона лет. Подобная точность позволит пользователям получать погрешность измерения на земле менее одного метра-это намного лучше чем стандартные открытые сервисы GPS.\nРазработка «Европейской GPS» очень терниста. Проект опаздывает по срокам на годы, и цена на окончание проекта ожидается в районе 7 миллиардов евро на 2020 год. Это намного выше чем планировалось изначально членами ЕС","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292c00"},"id":"18","title":"Ученые нашли связь между бранью и честностью","summary":"Психологи выяснили, что люди, которые часто проклинают все на свете, более честные.","createdAt":{"$date":"2017-01-19T11:59:00.000Z"},"author":"krasandm","tags":["ложь","психология"],"content":"Брань давно ассоциируется с гневом и грубостью, но сквернословие может иметь другой, более позитивный оттенок. Психологи выяснили, что люди, которые часто проклинают все на свете, более честные. Исследование ученых из четырех стран мира продемонстрировали, что люди, которые используют ненормативную лексику, менее склонны быть связаны с ложью и обманом.\nВ большинстве социальных условий использование обсценной лексики считается нецелесообразным и неприемлемым. Это часто относится к языку, который содержит сексуальные обращения, богохульные и другие вульгарные термины. Обычно их связывают с выражением таких эмоций как гнев, разочарование или удивление. В некоторых случаях брань используется для того, чтобы развлечь и завоевать аудиторию.\nИнтерес к пониманию психологических корней использования ненормативной лексики восходит к началу XX века, однако все исследования на эту тему разрознены и разбросаны по разным научным направлениям. Лишь с недавних пор некоторые исследователи пытаются соединить выводы ученых в единую систему.\nПротиворечивое отношение к ругани и ее социальному воздействию изменялось в течение десятилетий. Чтобы это понять, достаточно обратиться к истории кинематографа. Так первой звуковой кинолентой, в которой прозвучала брань, стал культовый фильм «Унесенные ветром». Выражение «Damn Yankees» («чертовы Янки») впервые звучит в усадьбе «Двенадцать дубов» из уст Скарлетт О'Хара, роль которой исполнила Вивьен Ли. Однако культовой фразой, получившей впоследствии признание Американского института кинематографии, стала фраза героя Кларка Гейбла «Frankly my dear, I don't give a damn» («Честно говоря, моя дорогая, мне наплевать»), которая заняла первую строчку в рейтинге «100 известных цитат из американских фильмов за 100 лет по версии AFI». Сегодня зарубежные фильмы, телепередачи и книги наполнены бранными словами и, по большей части, мы стали более терпимы к ним. Тем временем в России уже два с половиной года действует закон о запрете нецензурной лексики в теле- и радиоэфире, кинопрокате и на культурных мероприятиях, который вступил в силу 1 июля 2014 года.\nТак как обман и сквернословие считаются девиантными языковыми формами, они часто рассматриваются как свидетельство низких моральных принципов. С другой стороны, брань может быть положительно связана с честностью. Она часто используется, чтобы выразить «нефильтрованные» чувства и искренность. В качестве примера исследователи приводят президента США Дональда Трампа, который использовал бранные слова в некоторых своих выступлениях во время прошлогодней предвыборной кампании. Многие считали, что его выступления более искренние, чем у соперников.\nКонтролируемое использование ненормативной лексики часто помогает передать свой взгляд на мир или внутреннее состояние, но с неменьшей охотой применяется для оскорбления кого-либо. Речь, в которой есть бранные слова, оказывает более сильное влияние на людей, чем выступление, лишенное их.\nДоктор Дэвид Стиллуэлл (David Stillwell), преподаватель аналитики больших данных в Кембриджском университете и соавтор исследования отмечает, что отношение между руганью и нечестностью довольно хитрые. Брань часто бывает неуместной, но также она может быть свидетельством того, что кто-то говорит вам свое честное мнение. Собеседник, который не фильтрует свою речь, не делает этого и со своими взглядами.\nМеждународная команда ученых из Нидерландов, Великобритании, США и Гонконга задалась целью выяснить мнение людей о такого рода выражениях в серии анкет, которые включали взаимодействия с пользователями социальных сетей.\nВ первой анкете 276 участникам предложили перечислить наиболее часто используемые и любимые ругательства. Ученые также попросили оценить причины, по которым они используют эти слова, а затем измерили уровень честности с помощью шкалы лжи из личностного опросника Айзенка. Эта шкала является одним из наиболее распространенных показателей для оценки индивидуальных различий во лжи, когда респонденты хотят, чтобы их ответы были социально приемлемыми. Результаты проверки показали, что те, кто написали большее количество ругательств, были менее склонны ко лжи.\nПредоставив участникам эксперимента возможность свободно ругаться, ученые ожидали, что ежедневное использование и удовольствие от ненормативной лексики так или иначе отразится на общем количестве написанных слов. Они также выяснили, что наиболее популярные причины использования ругательств – выражение отрицательных эмоций, привычка, самовыражение. Кроме того, участники отметили, что неприятно выражались в те моменты, когда были более честны в разговоре о своих чувствах или когда боролись с негативными эмоциями. На последних строчках в этом рейтинге причин для использования ругательств оказалось оскорбление окружающих и запугивание.\nВторая часть исследования заключалась в сборе данных и от 74 тысяч пользователей Facebook и их лингвистическом анализе их статусов, чтобы измерить количество используемых бранных слов в общении в социальных сетях.\nДля определения уровня честности исследователи воспользовались программой Linguistic Inquiry and Word Count, которая позволяет получать числовые значения параметров текста – процент слов определенных грамматических, лексико-семантических категорий от общего числа слов в тексте. В 2003 году Ученые Ньюман, Пеннебейкер, Берри и Ричардс в ходе анализа пришли к выводу, что лжецы используют меньше местоимений от первого, третьего лица и отрицательных частиц. Вместо этого они часто пользуются глаголами движения и негативными выражениями.\nТакое положение вещей исследователи объяснили тем, что нечестные люди сознательно стараются «откреститься» от лжи и поэтому не относят ее к себе, предпочитая использовать более абстрактные слова при обращении к другим. Опираясь на это исследование, международная группа предположила, что те пользователи Facebook, которые ругаются чаще, будут использовать точно такие языковые образцы.\nИз ответов пользователей можно было выделить различие в точках зрения на использование бранных слов и выражений, которое существует между разными географическими районами. Например, в северо-восточных штатах (Коннектикут, Делавэр, Нью-Джерси и Нью-Йорк) люди более честны в своих ругательствах, чем жители американского юга – Южной Каролины, Арканзаса, Теннесси и Миссисипи.\nНаучная работа опубликована в Sage Journals 15 января 2017 года.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292c01"},"id":"19","title":"Сноудену продлили ВНЖ до 2019 года, но получить российское гражданство будет непросто","summary":"17 января 2017 года официальный представитель МИД России упомянула в Facebook, что Сноудену продлён вид на жительство ещё на два года.","createdAt":{"$date":"2017-01-19T13:01:00.000Z"},"author":"alizar","tags":["сноуден","эдвард сноуден","гражданство РФ"],"content":"Бывший сотрудник ЦРУ и АНБ Эдвард Сноуден, который раскрыл факты тотальной слежки за гражданами со стороны американских спецслужб, продолжит жить в засекреченной квартире по неизвестному адресу в России ещё некоторое время. 17 января 2017 года официальный представитель МИД России упомянула в Facebook, что Сноудену продлён вид на жительство ещё на два года.\nДаже если преждевременное продление вида на жительства российским МИД было сделано с целью уколоть американских коллег, это всё равно отличная новость для Сноудена, который может и дальше чувствовать себя в РФ в относительной безопасности. Более того, скоро у него будет право претендовать на получение российского гражданства.\nСогласно ФЗ от 31.05.2002 № 62-ФЗ «О гражданстве Российской Федерации», для получения гражданства РФ требуется постоянное проживание на территории России не менее пяти лет с момента получения вида на жительство.\nЭдвард Сноуден прилетел в транзитную зону аэропорта Шереметьево 23 июня 2013 года, а 1 августа 2013 года получил временное убежище в России сроком на один год. 1 августа 2014 года Эдвард получил ВНЖ сроком на три года. Таким образом, ему осталось продержаться 2,5 года, прежде чем он получит право претендовать на российский паспорт. Правда, для получения гражданства в общем порядке ему необходимо выполнить ряд других условий, кроме пятилетнего проживания. Вот эти условия, согласно российскому законодательству:\nПроживание в России 5 лет с момента получения вида на жительства (ВНЖ). Покидать Россию можно, но не больше чем на 3 месяца в течение 1 года. Данный срок может быть уменьшен до 1 года, если человек имеет большие научные, технические или культурные достижения; Россия заинтересована в нем в профессиональном плане; если предоставлено политическое убежище; а также если человек является беженцем.\nНеобходимо взять на себя обязательство по исполнению российских законов.\nНеобходимо иметь официальный доход.\nТребуется отказаться от иного гражданства. От иного гражданства можно не отказываться в случаях, когда основания для этого есть в соответствующих нормативных актах или международных договорах.\nНеобходимо знание русского языка.\nКак видим, пятилетний срок пребывания при желании можно сократить, если предоставить Сноудену политическое убежище, но остальным критериям он должен соответствовать: иметь официальный доход, знать русский язык и отказаться от американского гражданства. Очень маловероятно, что Эдвард сможет и захочет соответствовать этим критериям.\nЕсть ещё несколько теоретических вариантов получения гражданства в упрощённом порядке. Например, при наличии несовершеннолетнего ребёнка — гражданина РФ, если второй родитель, являющийся гражданином РФ, скончался, лишён родительских прав, ограничен в родительских правах. Или при условии работы на территории РФ по профессии, которая включена в перечень профессий, занимаемых иностранцами, которые вправе претендовать на получение гражданства в упрощенном порядке.\nВ этом случае Эдвард Сноуден тоже может не соблюдать пятилетний срок пребывания на территории РФ, но всё равно должен соответствовать остальным требованиям, в том числе отказаться от американского гражданства.\nНа вопрос, собирается ли американец подавать документы на приобретение российского паспорта, его адвокат Анатолий Кучерена ответил: «Это будет решать лично Эдвард Сноуден».\nВ США Сноудену заочно предъявлены обвинения в шпионаже и хищении государственной собственности. Власти США оперативно аннулировали его паспорт, так что Сноуден не смог вылететь на Кубу и был вынужден остаться в России.\nМИД РФ отверг, вероятно, шуточное предложение бывшего заместителя ЦРУ Майкла Морелла передать Сноудена в качестве «идеального подарка» к инаугурации нового президента США. По заявлению российских представителей, такое предложение — это «идеология предательства», а в России не принято «преподносить подарки в виде людей и сдавать тех, кто ищет защиты».\nВ последние недели работы администрации Обамы более 1,1 млн граждан подписали петицию к президенту помиловать Сноудена, но он так и не решился этого сделать. Хотя всё-таки нашёл в себе силы помиловать (смягчить наказание) Челси Мэннинг — бывшего офицера армии, который украл и слил в Wikileaks около 750 000 военных документов, её выпустят на свободу 17 мая 2017 года. Это было очень неожиданно и приятно. Сам Сноуден поблагодарил президента за проявление истинного гуманизма.\nВ полдень 20 января 2017 года состоится инаугурация нового президента США, который гораздо строже Обамы относится к вопросам национальной безопасности.\nМожет быть, Обама мог бы сделать ещё один жест для Сноудена в последний день работы администрации, но после демарша российского МИДа это будет выглядеть странно.","isHidden":false}
{"_id":{"$oid":"59188f74fcdcbe1334292c02"},"id":"20","title":"Закончено расследованиe аварии машины Tesla с функциями автопилота. Компания признана невиновной","summary":"Cистема автопилота признана невиновной в случившейся аварии.","createdAt":{"$date":"2017-01-20T01:47:00.000Z"},"author":"Nubus","tags":["тесла","tesla","авария","автопилот","автомобили","расследование"],"content":"Национальная администрация безопасности дорожного движения США опубликовала полный отчет по делу об аварии со смертельным исходом при использовании водителем функции автопилота.\nВ отчете сказано что система автопилота признана невиновной в случившейся аварии. Во многих частях документа было замечено что система была сделана с упором на безопасность и на общее снижение аварий с участием машин Tesla.\nВ частности агентством было замечено что после введения функции автопилота, общее количество аварий на дороге с участием машин Tesla упало на 40%. Также было отмечено что агентством не найдено каких-либо ошибок в дизайне или реализации функции автоматического аварийного торможения. Было отмечено, что компания Tesla изначально была уверена в том, что систему автопилотирования будут использовать в более широких рамках, чем указано компанией Tesla, и поэтому подобные сценарии были заложены в дизайн данной системы перед тем, как представить ее общественности.\nДанные выводы это лучшее, на что могла надеяться компания Tesla из расследования, которое велось более шести месяцев. Агенство Рейтер рассказало в четверг о том, что компания Tesla не будет отзывать свои машины из-за данного расследования.\nЕдинственное замечание, которое сделали инспекторы, это то, что компания Tesla могла-бы давать более точную оценку возможностей автопилота, но в то же время они признают, что вся необходимая информация предоставлена водителям и владельцам машин.\nВ ответ на окончание расследования и последующие выводы, компания Tesla сделала следующее заявление: «Для компании Tesla безопасность наших клиентов стоит на первом месте. Мы ценим детальность отчета национальной администрации безопасности движения США, а также выводы из него.»\nUPD\nПо поводу вопроса, кто именно виноват выводов в отчете нет, но…\nВ отчете сказано, что все модели автоматического аварийного торможения помогают только для предотвращения столкновения *в жопу* впереди идущего автомобиля. Абсолютно все они проваливают тест на предотвращение столкновения на пересекающихся курсах или при перестроении. В частности, если вас подрежут и резко затормозят, то автопилот и аварийное торможение скорее всего не помогут.\nПоэтому Tesla везде предупреждает, чтобы руки были на руле, а внимание на дороге.","isHidden":false}
